AplicacionLibroOnline/test/TestCaseCompra/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ven="http://xml.netbeans.org/schema/ventaXmlSchema">
  <soapenv:Body>
    <ven:myInput>
      <ven:isbn>2928183</ven:isbn>
      <ven:idCliente>1</ven:idCliente>
      <ven:unidades>5</ven:unidades>
      <ven:precioUnidad>10</ven:precioUnidad>
      <ven:idCredito>1</ven:idCredito>
    </ven:myInput>
  </soapenv:Body>
</soapenv:Envelope>